TARGET = cw #Задаем переменную с названием компилируемого исполняемого файла
CC = gcc

SRC = $(wildcard *.c) #Список всех файлов .c 
OBJ = $(patsubst %.c, %.o, $(SRC)) #Список объектных файлов


$(TARGET): $(OBJ) #Правило создания целевой программы
#Команда компиляции всех объектных файлов в исполняемый файл
	$(CC) $(OBJ) -o $(TARGET)

$(PREF_OBJ)%.o: %.c *.h # Правило компиляции
#Команда компиляции отдельного исходного файла в объектный
	$(CC) -c $< -o $@ 

clean: #Удаление скомпилированных файлов
	rm $(TARGET) $(OBJ)