TARGET = cw #Задаем переменную с названием компилируемого исполняемого файла
CC = gcc

PREF_SRC = ./src/
PREF_OBJ = ./obj/

SRC = $(wildcard $(PREF_SRC)*.c) #Список всех файлов .c 
OBJ = $(patsubst $(PREF_OBJ)%.c, $(PREF_OBJ)%.o, $(SRC)) #Список объектных файлов


$(TARGET): $(OBJ) #Правило создания целевой программы menu
#Команда компиляции всех объектных файлов в исполняемый файл
	$(CC) $(OBJ) -o $(TARGET)

$(PREF_OBJ)%.o: %.c *.h # Правило компиляции
#Команда компиляции отдельного исходного файла в объектный
	$(CC) -c $< -o $@ 

clean: #Удаление скомпилированных файлов
	rm $(TARGET) *.o 